---
kind: type
id: T:Autodesk.Revit.DB.MathComparisonUtils
source: html/ddb32a4c-b742-0286-36b5-e5f2ce0d1daf.htm
---
# Autodesk.Revit.DB.MathComparisonUtils

This class contains a set of mathematical utilities to compare doubles, using the internal tolerance.

## Syntax (C#)
```csharp
public static class MathComparisonUtils
```